TRIGGERS = {'гоша', 'гена', 'генадий'}


data_set = {

    #интернет                                                                                #weather
    'открой браузер': 'browser браузер открыт',
    'запусти браузер': 'browser открываю браузер',
    'интернет открой': 'browser открываю браузер',

    #ютуб                                                                                #weather
    'зайди в ютуб': 'browser открываю ютуб',
    'открой ютуб': 'browser открываю ютуб',

    #фильм                                                                                #search_movie
    'посмотреть фильм': 'search_movie можешь посмотреть фильм здесь',
    'фильм': 'search_movie я открыл для тебя список фильмов, можешь выбрать подходящий',
    'фильм исторический': 'search_movie_history открыл исторические фильмы',

    #управление ботом                                                                     #offBot
    'отключись': 'offBot отключаюсь ',

    #разговор с ботом                                                                     #passive
    'как у тебя дела': 'passive работаю в фоне, не переживай',
    'работаешь': 'passive как видишь',
    'ты тут': 'passive всегда с вами',
    'ты здесь': 'passive да, я всё ещё здесь',
    'скажи привет': 'passive привет я голосовой ассистент Гоша',

    #компьютер
    'выключить ноутбук': 'offpc отключаюсь ',
    'домой': 'home закрываю все вкладки',
    'закрой все окна': 'home закрываю все окна',
    'создай проект': 'create_project новый проект создан',
    'открой проект': 'proect открываю',

    #музыка                                                                                #music
    'музыка': 'music включаю плейлист',
    'музыку': 'music включаю плейлист',

    #openAI
    'есть вопрос': 'openAI диктуйте свой вопрос',
    'гпт': 'openAI диктуйте',
    'включи гпт': 'openAI всё работает',
    #'сообщение в телеграме': 'telegram пишу сообщение',

    #картинка мем
    'сгенерируй':'picture секунду',

    #telegram
    'сообщение': 'telegramto слушаю',

    'о себе': 'passive Я бот, который может управлять ноутбуком по голосовой команде, также в меня встроен искусственный интеллект, я могу отвечать на разные вопросы',
    'привет': 'passive Руслан пиши мне в директ а не в группу, сейчас искуственным интелектом никого не удивишь'
}